package org.example;

public class Main {
    public static void main(String[] args) {
//        1.Дано уравнение x/6+25=98. Найти x и вывести его в консоль
        int x1;
        x1=(98-25)*6;
        System.out.println("Результат задачи1: " + x1);
//        2. x=x+5; y=y*9; z=z-6; Необходимо укоротить данные выражения,
//        чтобы результат не изменился. x=8; y=9; z=12;
//        (операции присваивания, нужно просто написать по-другому)
        int x2 = 8;
        int y2 = 9;
        int z2 = 12;
        x2+=5;
        y2*=9;
        z2-=6;
        System.out.println("Результат задачи2: x=" +x2 + " y=" +y2+" z=" +z2);
//        3. Даны числа a=35, b=65. Если а>b, то присвоить числу c значение 5 иначе,
//        присвоить числу c значение 10. (тернарный оператор)
        int a =35;
        int b =65;
        int c;
        if (a>b){
            c = 5;
        }
        else{
            c = 10;
        }
        System.out.println("Результат задачи3: c=" + c);
//        4*. Даны значения: x=5; y=2; c=x*y;
//        Расставьте операции инкремента декремента так,
//        чтобы после выполнения операции (c=x*y)
//        с равнялось 12, x=равнялось 6, y=1
//        Выведите полученные значения в консоль.
//        Эта задача со звёздочкой, необязательна к выполнению, но рекомендую её сделать.
        int x4 =5;
        int y4 =2;
        int c4;
        c4=++x4*y4--;
        System.out.println("Результат задачи4: c=" +c4 + " x=" + x4 + " y=" + y4);
//        1. На вход даны 3 числа. Вывести в консоль только четные числа

//        2. На вход даны 3 числа. Вывести в консоль только те числа, которые делятся на 2 и на 5
//        (используйте оператор % для проверки деления без остатка)

//        3. Дано 15/x=result, где x-число, которое вводится с командной строки, result-результат вычисления.
//        Написать программу, которая будет выводит разный текст, в зависимости от значения result.
//        В случае result=3, вывести: "Результат деления равен 3" В случае result=5 вывести:
//        "Результат деления равен 5" В других случаях вывести: "Результат деления равен дробному числу". П
//        ри этом в последнем случае вывести точный результат деления (использовать приведение типов)
//        Для выполнения задания использовать оператор switch- case Подготовить пул реквест в ветку master.
//        Ссылку на пул реквест скидывайте мне в личку
    }
}